In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

## Series

In [3]:
obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])

obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a']

-5

In [9]:
obj2['d'] = 6

In [10]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [11]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
import numpy as np

np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [17]:
obj3 = pd.Series(sdata)

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [19]:
obj4 = pd.Series(sdata, index = states)

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [26]:
obj4.name = 'population'

In [27]:
obj4.index.name = 'state'

In [28]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [29]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [30]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [31]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [32]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [33]:
frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [34]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [35]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [36]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                      index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [37]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [38]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [39]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [40]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [41]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [42]:
frame2['debt'] = 16.5

In [43]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [44]:
frame2['debt'] = np.arange(6.)

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [45]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [46]:
frame2['debt'] = val

In [47]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [48]:
frame2['eastern'] = frame2.state == 'Ohio'

In [49]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [50]:
del frame2['eastern']

In [51]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [52]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [53]:
frame3 = pd.DataFrame(pop)

In [54]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [55]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [56]:
pd.DataFrame(pop, index = [2001, 2002, 2003])

AttributeError: 'list' object has no attribute 'astype'

In [57]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [58]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [59]:
frame3.index.name = 'year'

frame3.columns.name = 'state'

In [60]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [61]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [62]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

## Index Objects

In [63]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])

In [64]:
index = obj.index

In [65]:
index

Index(['a', 'b', 'c'], dtype='object')

In [66]:
index[1:]

Index(['b', 'c'], dtype='object')

In [67]:
index[1] = 'd'  # TypeError

TypeError: Index does not support mutable operations

In [68]:
labels = pd.Index(np.arange(3))

In [69]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [70]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [71]:
obj2.index is labels

True

In [72]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [73]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [74]:
'Ohio' in frame3.columns

True

In [75]:
2003 in frame3.index

False

In [76]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [77]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# Some Index methods (examples)

## append()

In [78]:
df1 = pd.Index([17, 69, 33, 5, 0, 74, 0])

df2 = pd.Index([11, 16, 54, 58])

print(df1, "\n", df2)

Int64Index([17, 69, 33, 5, 0, 74, 0], dtype='int64')
 Int64Index([11, 16, 54, 58], dtype='int64')

In [79]:
df1.append(df2)

Int64Index([17, 69, 33, 5, 0, 74, 0, 11, 16, 54, 58], dtype='int64')

In [80]:
df1 = pd.Index(['Jan', 'Feb', 'Mar', 'Apr'])

df2 = pd.Index(['May', 'Jun', 'Jul', 'Aug'])

df3 = pd.Index(['Sep', 'Oct', 'Nov', 'Dec'])

print(df1, "\n", df2, "\n", df3)

Index(['Jan', 'Feb', 'Mar', 'Apr'], dtype='object')
 Index(['May', 'Jun', 'Jul', 'Aug'], dtype='object')
 Index(['Sep', 'Oct', 'Nov', 'Dec'], dtype='object')

In [81]:
df1.append([df2, df3])

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct',
       'Nov', 'Dec'],
      dtype='object')

## difference()

In [82]:
idx1 = pd.Index([2, 1, 3, 4])
idx2 = pd.Index([3, 4, 5, 6])

idx1.difference(idx2)

Int64Index([1, 2], dtype='int64')

In [83]:
idx = pd.Index([17, 69, 33, 15, 19, 74, 10, 5])

idx.difference([69, 33, 15, 74, 19])

Int64Index([5, 10, 17], dtype='int64')

In [84]:
idx1 = pd.Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun',
                 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'])

idx2 = pd.Index(['May', 'Jun', 'Jul', 'Aug'])

idx1.difference(idx2)

Index(['Apr', 'Dec', 'Feb', 'Jan', 'Mar', 'Nov', 'Oct', 'Sep'], dtype='object')

## intersection()

In [85]:
idx1 = pd.Index(['Labrador', 'Beagle', 'Mastiff',
                 'Lhasa', 'Husky', 'Beagle'])

idx2 = pd.Index(['Labrador', 'Great_Dane', 'Pug',
                 'German_Shepherd', 'Husky', 'Pitbull'])

idx2.intersection(idx1)

Index(['Labrador', 'Husky'], dtype='object')

In [86]:
idx1 = pd.Index(['2015-10-31', '2015-12-02', None, '2016-01-03',
                 '2016-02-08', '2017-05-05', '2014-02-11'])

idx2 = pd.Index(['2015-10-31', '2015-10-02', '2018-01-03',
                 '2016-02-08', '2017-06-05', '2014-07-11', None])

print(idx1, "\n", idx2)

Index(['2015-10-31', '2015-12-02',         None, '2016-01-03', '2016-02-08',
       '2017-05-05', '2014-02-11'],
      dtype='object')
 Index(['2015-10-31', '2015-10-02', '2018-01-03', '2016-02-08', '2017-06-05',
       '2014-07-11',         None],
      dtype='object')

In [87]:
idx1.intersection(idx2)

Index(['2015-10-31', None, '2016-02-08'], dtype='object')

## union()

In [88]:
idx1 = pd.Index([10, 20, 18, 32])

idx2 = pd.Index([21, 10, 30, 40, 50])

idx1.union(idx2)

Int64Index([10, 18, 20, 21, 30, 32, 40, 50], dtype='int64')

In [89]:
idx1 = pd.Index(['Harry', 'Mike', 'Arthur', 'Nick'], 
                name = 'Student')

idx2 = pd.Index(['Alice', 'Bob', 'Rachel', 'Tyler', 'Louis'],
                name = 'Winners')

idx1.union(idx2)

Index(['Alice', 'Arthur', 'Bob', 'Harry', 'Louis', 'Mike', 'Nick', 'Rachel',
       'Tyler'],
      dtype='object')

## isin()

In [90]:
idx = pd.Index(['Labrador', 'Beagle', 'Mastiff', 'Lhasa',
                'Husky', 'Beagle'])

idx.isin(['Lhasa', 'Mastiff'])

array([False, False,  True,  True, False, False])

In [91]:
midx = pd.MultiIndex.from_arrays([['Mon', 'Tue', 'Wed', 'Thu'],
                                  [10, 20, 30, 40]], 
                                 names = ('Days', 'Target'))

midx

MultiIndex(levels=[['Mon', 'Thu', 'Tue', 'Wed'], [10, 20, 30, 40]],
           labels=[[0, 2, 3, 1], [0, 1, 2, 3]],
           names=['Days', 'Target'])

In [92]:
midx.isin(['Tue', 'Wed', 'Fri', 'Sat'], level = 'Days')

array([False,  True,  True, False])

## delete()

In [93]:
idx = pd.Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun',
                'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'])

In [94]:
idx.delete(0)

Index(['Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov',
       'Dec'],
      dtype='object')

In [95]:
idx = pd.Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun',
                'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'])

In [96]:
idx.delete([2, 3, 4, 5])

Index(['Jan', 'Feb', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'], dtype='object')

## drop()

In [97]:
idx = pd.Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun',
                'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'])

In [98]:
idx.drop(['Jan', 'Dec'])

Index(['Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov'], dtype='object')

In [99]:
idx = pd.Index(['2015-01-31', '2015-12-02', '2016-01-03',
                '2016-02-08', '2017-05-05', '2014-02-11'])

In [100]:
idx.drop(['2015-12-02', '2016-02-08'])

Index(['2015-01-31', '2016-01-03', '2017-05-05', '2014-02-11'], dtype='object')

## insert()

In [101]:
idx = pd.Index(['Labrador', 'Beagle', 'Labrador', 'Lhasa',
                'Husky', 'Beagle'])

In [102]:
idx.insert(1, 'Great_Dane')

Index(['Labrador', 'Great_Dane', 'Beagle', 'Labrador', 'Lhasa', 'Husky',
       'Beagle'],
      dtype='object')

In [103]:
idx = pd.Index(['Labrador', 'Beagle', 'Labrador', 'Lhasa',
                'Husky', 'Beagle'])

In [104]:
idx.insert(-1, 'Great_Dane')

Index(['Labrador', 'Beagle', 'Labrador', 'Lhasa', 'Husky', 'Great_Dane',
       'Beagle'],
      dtype='object')

## is_monotonic()

In [105]:
sr = pd.Series(['New York', 'Chicago', 'Toronto', 'Lisbon'])

In [106]:
sr.index = ['City 1', 'City 2', 'City 3', 'City 4']

In [107]:
print(sr)

City 1    New York
City 2     Chicago
City 3     Toronto
City 4      Lisbon
dtype: object

In [108]:
sr.is_monotonic

False

In [109]:
sr = pd.Series(['1/1/2018', '2/1/2018', '3/1/2018', '4/1/2018'])

In [110]:
sr.index = ['Day 1', 'Day 2', 'Day 3', 'Day 4']

In [111]:
print(sr)

Day 1    1/1/2018
Day 2    2/1/2018
Day 3    3/1/2018
Day 4    4/1/2018
dtype: object

In [112]:
sr.is_monotonic

True

## is_unique()

In [113]:
sr = pd.Series(['New York', 'Chicago', 'Toronto', 'Lisbon',
                'Chicago'])

In [114]:
sr.index = ['City 1', 'City 2', 'City 3', 'City 4', 'City 5']

In [115]:
print(sr)

City 1    New York
City 2     Chicago
City 3     Toronto
City 4      Lisbon
City 5     Chicago
dtype: object

In [116]:
sr.is_unique

False

In [117]:
sr = pd.Series(['1/1/2018', '2/1/2018', '3/1/2018', '4/1/2018'])

In [118]:
sr.index = ['Day 1', 'Day 2', 'Day 3', 'Day 4']

In [119]:
print(sr)

Day 1    1/1/2018
Day 2    2/1/2018
Day 3    3/1/2018
Day 4    4/1/2018
dtype: object

In [120]:
sr.is_unique

True

## unique()

In [121]:
idx = pd.Index(['Harry', 'Mike', 'Arthur', 'Nick',
                'Harry', 'Arthur'], name = 'Student')

print(idx)

Index(['Harry', 'Mike', 'Arthur', 'Nick', 'Harry', 'Arthur'], dtype='object', name='Student')

In [122]:
idx.unique()

Index(['Harry', 'Mike', 'Arthur', 'Nick'], dtype='object', name='Student')

In [123]:
idx = pd.Index([21, 10, 30, 40, 50, 10, 50])

print(idx)

Int64Index([21, 10, 30, 40, 50, 10, 50], dtype='int64')

In [124]:
idx.unique()

Int64Index([21, 10, 30, 40, 50], dtype='int64')

# 5.2 Essential Functionality

## Reindexing

In [125]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [126]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [127]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [128]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [129]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [130]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [131]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index = ['a', 'c', 'd'],
                     columns = ['Ohio', 'Texas', 'California'])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [132]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [133]:
states = ['Texas', 'Utah', 'California']

In [134]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [135]:
frame.loc[['a', 'b', 'c', 'd'], states]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [136]:
df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3, 4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]},
                  index = ["first", "second", "third", "fourth",
                           "fifth"])

df

        A  B  C   D
first   1  3  2   4
second  5  2  2   3
third   3  4  7   6
fourth  4  3  3  12
fifth   2  4  4   7

In [137]:
df.reindex(["first", "dues", "trois", "fourth", "fifth"])

          A    B    C     D
first   1.0  3.0  2.0   4.0
dues    NaN  NaN  NaN   NaN
trois   NaN  NaN  NaN   NaN
fourth  4.0  3.0  3.0  12.0
fifth   2.0  4.0  4.0   7.0

In [138]:
df.reindex(["first", "dues", "trois", "fourth", "fifth"],
           fill_value = 100)

          A    B    C    D
first     1    3    2    4
dues    100  100  100  100
trois   100  100  100  100
fourth    4    3    3   12
fifth     2    4    4    7

In [139]:
df1 = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                    "B": [3, 2, 4, 3, 4],
                    "C": [2, 2, 7, 3, 4],
                    "D": [4, 3, 6, 12, 7]})

In [140]:
df1.reindex(columns = ["A", "B", "D", "E"])

   A  B   D   E
0  1  3   4 NaN
1  5  2   3 NaN
2  3  4   6 NaN
3  4  3  12 NaN
4  2  4   7 NaN

In [141]:
df1.reindex(columns = ["A", "B", "D", "E"], fill_value = 25)

   A  B   D   E
0  1  3   4  25
1  5  2   3  25
2  3  4   6  25
3  4  3  12  25
4  2  4   7  25

In [142]:
N = 20

df = pd.DataFrame({
    'A': pd.date_range(start = '2016-01-01', periods = N, freq = 'D'),
    'x': np.linspace(0, stop = N - 1, num = N),
    'y': np.random.rand(N),
    'C': np.random.choice(['Low', 'Medium', 'High'], N).tolist(),
    'D': np.random.normal(100, 10, size = (N)).tolist()
})

df_reindexed = df.reindex(index = [0, 2, 5], columns = ['A', 'C', 'B'])

print(df_reindexed)

           A       C   B
0 2016-01-01    High NaN
2 2016-01-03    High NaN
5 2016-01-06  Medium NaN

In [143]:
df1 = pd.DataFrame(np.random.randn(10, 3), 
                  columns = ['col1', 'col2', 'col3'])

df2 = pd.DataFrame(np.random.randn(7, 3),
                  columns = ['col1', 'col2', 'col3'])

df1 = df1.reindex_like(df2)

df1

       col1      col2      col3
0  0.630153 -1.742421  1.337547
1  0.539023  1.298852  0.508103
2 -0.478045 -0.496553 -0.655632
3 -1.221317  0.119825 -0.580252
4  1.434333  0.145228  0.507630
5  0.111866 -1.863618 -0.150194
6  1.264977  0.673945 -0.132083

In [144]:
df1 = pd.DataFrame(np.random.randn(6, 3), 
                   columns = ['col1', 'col2', 'col3'])

df2 = pd.DataFrame(np.random.randn(2, 3),
                   columns = ['col1', 'col2', 'col3'])

df2.reindex_like(df1)

       col1      col2      col3
0  0.728631 -0.038926 -0.492457
1 -0.679480  0.643904 -0.493122
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

In [145]:
print("Data Frame with Forward Fill: ")

df2.reindex_like(df1, method = 'ffill')

Data Frame with Forward Fill:

       col1      col2      col3
0  0.728631 -0.038926 -0.492457
1 -0.679480  0.643904 -0.493122
2 -0.679480  0.643904 -0.493122
3 -0.679480  0.643904 -0.493122
4 -0.679480  0.643904 -0.493122
5 -0.679480  0.643904 -0.493122

In [146]:
print("Data Frame with Forward Fill limiting to 1: ")

df2.reindex_like(df1, method = 'ffill', limit = 1)

Data Frame with Forward Fill limiting to 1:

       col1      col2      col3
0  0.728631 -0.038926 -0.492457
1 -0.679480  0.643904 -0.493122
2 -0.679480  0.643904 -0.493122
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

In [147]:
df1 = pd.DataFrame(np.random.randn(6, 3), 
                   columns = ['col1', 'col2', 'col3'])

df1

       col1      col2      col3
0 -1.016660  0.832424 -0.054813
1  0.832636 -1.190647 -0.750818
2 -1.296023  0.640261  0.654832
3  0.210888 -0.866563 -0.489651
4 -1.000974 -1.102448 -1.689527
5  0.145822 -0.302675  0.715478

In [148]:
print("After renaming the rows and columns: ")

df1.rename(columns = {'col1': 'c1', 'col2': 'c2'},
           index = {0: 'apple', 1: 'banana', 2: 'durian'})

After renaming the rows and columns:

              c1        c2      col3
apple  -1.016660  0.832424 -0.054813
banana  0.832636 -1.190647 -0.750818
durian -1.296023  0.640261  0.654832
3       0.210888 -0.866563 -0.489651
4      -1.000974 -1.102448 -1.689527
5       0.145822 -0.302675  0.715478

## Dropping Entries from an Axis

In [149]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [150]:
new_obj = obj.drop('c')

new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [151]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [152]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [153]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [154]:
data.drop('two', axis = 1) #axis = 1 is used to drop columns

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [155]:
data.drop(['two', 'four'], axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [156]:
obj.drop('c', inplace = True)

In [157]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

## Indexing, Selection and Filtering

In [158]:
obj = pd.Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [159]:
obj['b']

1.0

In [160]:
obj[1]

1.0

In [161]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [162]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [163]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [164]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [165]:
# notice how the end - point is inclusive in slicing with labels

obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [166]:
obj['b':'c'] = 5

In [167]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [168]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [169]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [170]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [171]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [172]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [173]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [174]:
data[data < 5] = 0

In [175]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## Selection with loc and iloc

In [176]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [177]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [178]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [179]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [180]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [181]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [182]:
## pd.DataFrame.at() examples

df = pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]],
                  index = [4, 5, 6], columns = ['A', 'B', 'C'])

df

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [183]:
df.at[4, 'B']

2

In [184]:
df.at[4, 'B'] = 10

In [185]:
df.at[4, 'B']

10

In [186]:
df.loc[5].at['B']

4

In [187]:
## pd.DataFrame.iat() examples

df = pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]],
                  columns = ['A', 'B', 'C'])

df

    A   B   C
0   0   2   3
1   0   4   1
2  10  20  30

In [188]:
df.iat[1, 2]

1

In [189]:
df.iat[1, 2] = 10

In [190]:
df.iat[1, 2]

10

In [191]:
df.loc[0].iat[1]

2

In [192]:
## pd.DataFrame.get_value() examples

# check https://www.geeksforgeeks.org/python-pandas-dataframe-get_value/

In [193]:
## pd.DataFrame.set_value() examples

df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3, 4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]})

df

   A  B  C   D
0  1  3  2   4
1  5  2  2   3
2  3  4  7   6
3  4  3  3  12
4  2  4  4   7

In [194]:
df.set_value(2, 'B', 100)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

   A    B  C   D
0  1    3  2   4
1  5    2  2   3
2  3  100  7   6
3  4    3  3  12
4  2    4  4   7

In [195]:
df.set_value(8, 8, 1000)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

     A      B    C     D       8
0  1.0    3.0  2.0   4.0     NaN
1  5.0    2.0  2.0   3.0     NaN
2  3.0  100.0  7.0   6.0     NaN
3  4.0    3.0  3.0  12.0     NaN
4  2.0    4.0  4.0   7.0     NaN
8  NaN    NaN  NaN   NaN  1000.0

## Integer Indexes

In [196]:
ser = pd.Series(np.arange(3.))

ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [197]:
ser[-1] # will result in an error

KeyError: -1

In [198]:
ser2 = pd.Series(np.arange(3.), index = ['a', 'b', 'c'])

In [199]:
ser2[-1]

2.0

In [200]:
ser[:1]

0    0.0
dtype: float64

In [201]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [202]:
ser.iloc[:1]

0    0.0
dtype: float64

## Arithmetic and Data Alignment

In [203]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])

In [204]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], 
               index = ['a', 'c', 'e', 'f', 'g'])

In [205]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [206]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [207]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [208]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
                   columns = list('bcd'),
                   index = ['Ohio', 'Texas', 'Colorado'])

df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [209]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                   columns= list('bde'),
                   index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [210]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [211]:
df1 = pd.DataFrame({'A': [1, 2]})

df1

   A
0  1
1  2

In [212]:
df2 = pd.DataFrame({'B': [3, 4]})

df2

   B
0  3
1  4

In [213]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

## Arithmetic methods with fill values

In [214]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns = list('abcd'))

df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [215]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns = list('abcde'))

df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [216]:
df2.loc[1, 'b'] = np.nan

In [217]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [218]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [219]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [220]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [221]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [222]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0